# Operations

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    "Name": ["Amit", "Priya", "Ravi", "Neha"],
    "Age": [23, 21, 25, 22],
    "Marks": [85, 90, 88, 92]
})

In [3]:
df

    Name  Age  Marks
0   Amit   23     85
1  Priya   21     90
2   Ravi   25     88
3   Neha   22     92

In [4]:
# Add column
df["Grade"] = ["B", "A", "B", "A"]
df

    Name  Age  Marks Grade
0   Amit   23     85     B
1  Priya   21     90     A
2   Ravi   25     88     B
3   Neha   22     92     A

In [5]:
# Modify column
df["Marks"] = df["Marks"] + 5
df

    Name  Age  Marks Grade
0   Amit   23     90     B
1  Priya   21     95     A
2   Ravi   25     93     B
3   Neha   22     97     A

In [6]:
df["Markss"] = df["Marks"] + 5
df

    Name  Age  Marks Grade  Markss
0   Amit   23     90     B      95
1  Priya   21     95     A     100
2   Ravi   25     93     B      98
3   Neha   22     97     A     102

In [7]:
# Drop column
df = df.drop("Grade", axis=1)
df

    Name  Age  Marks  Markss
0   Amit   23     90      95
1  Priya   21     95     100
2   Ravi   25     93      98
3   Neha   22     97     102

In [8]:
# Rename
df.rename(columns={"Marks": "Score"}, inplace=True)
df

    Name  Age  Score  Markss
0   Amit   23     90      95
1  Priya   21     95     100
2   Ravi   25     93      98
3   Neha   22     97     102

In [9]:
# Replace values
df["Name"] = df["Name"].replace("Amit", "Aman")
df

    Name  Age  Score  Markss
0   Aman   23     90      95
1  Priya   21     95     100
2   Ravi   25     93      98
3   Neha   22     97     102